{
  "profile": {
    "first_name": "Abdellahi",
    "last_name": "Abdellahi",
    "location": "Nice, France",
    "summary": "Étudiant en Data Engineering et Software Engineering, spécialisé dans les pipelines de données, l'analyse quantitative, les architectures backend distribuées et les solutions IA/NLP. Expérience dans les systèmes bancaires, l'orchestration Airflow, l'IAM Keycloak (OAuth2, OIDC, JWT, SSO), la blockchain Ethereum et la conception d’algorithmes financiers. Passionné par la recherche d’information, l'automatisation à grande échelle et le développement de solutions analytiques orientées décisionnel. A la recherche d'un stage de 6 mois a partir de  mars 2026 ou alternance de 12 mois."
  },

  "education": [
    {
      "degree": "Applied MSc Data Engineering for AI",
      "school": "DSTI School of Engineering",
      "year": "2025 (en cours)"
    },
    {
      "degree": "Master en Software Engineering & DevOps",
      "school": "Horizon School of Digital Technologies",
      "year": "2023–2025"
    },
    {
      "degree": "Licence en Génie Logiciel & Systèmes d’Information",
      "school": "ESSTHS Hammam-Sousse",
      "year": "2020–2023"
    },
    {
      "degree": "Certificat — Banking and Financial Institutions",
      "school": "University of Illinois",
      "year": "2024"
    },
    {
      "degree": "AWS Cloud Practitioner",
      "school": "Amazon Web Services",
      "year": "2024"
    }
  ],

  "skills": {
    "programming_languages": ["Java", "Python", "SQL", "Bash", "TypeScript"],
    "frontend_frameworks": ["Angular", "HTML5", "CSS3", "Bootstrap"],
    "backend_frameworks": [
      "Spring Boot",
      "Spring Security",
      "Hibernate",
      "JPA",
      "REST API design",
      "Jakarta EE",
      "Unity3D (C#)",
      "numpy",
      "pandas",
      "scikit-learn",
      "keras",
      "tensorflow",
      "LangChain",
      "LangGraph",
      "Hugging Face"
    ],
    "identity_and_access_management": [
      "Keycloak",
      "OAuth2",
      "OpenID Connect",
      "JWT",
      "SSO",
      "RBAC",
      "ABAC",
      "User Federation",
      "Identity Provider Integration",
      "Keycloak Event Listener SPI"
    ],
    "data_engineering": [
      "Apache Airflow",
      "ETL/ELT pipelines",
      "Data ingestion",
      "Data transformation",
      "Data modeling",
      "Data quality",
      "Batch processing",
      "Scheduling",
      "Workflow orchestration",
      "PostgreSQL",
      "Oracle SQL"
    ],
    "nlp_and_search": [
      "spaCy",
      "Transformers",
      "Sentence Embeddings",
      "TF-IDF",
      "Cosine similarity",
      "Keyword extraction",
      "NER",
      "RAG (Retrieval-Augmented Generation)",
      "Semantic search"
    ],
    "quantitative_analysis": [
      "Modélisation financière",
      "Black-Scholes",
      "Pricing d’options",
      "Analyse de volatilité",
      "Actualisation de flux (DCF)",
      "Gordon Growth Model (GGM)",
      "WACC",
      "Modèles stochastiques",
      "Sensibilité Delta/Gamma/Vega"
    ],
    "blockchain": [
      "Ethereum",
      "Smart Contracts",
      "Settlement on-chain",
      "PoC remplacement d’un CBS par validateur Ethereum",
      "EVM",
      "Transactions et gas optimization"
    ],
    "cloud_and_devops": [
      "Docker",
      "Kubernetes",
      "Helm",
      "Argo CD",
      "GitLab CI/CD",
      "Terraform",
      "Linux",
      "Cluster deployment",
      "Gorq-api",
      "OpenAI"
    ],
    "event_driven_architecture": [
      "Kafka",
      "Event sourcing",
      "Asynchronous messaging",
      "Outbox Pattern",
      "Real-time streaming"
    ],
    "tools": [
      "Git",
      "Maven",
      "BPMN",
      "ISO20022",
      "PCI DSS",
      "Mermaid",
      "IntelliJ",
      "Kibana",
      "Jenkins",
      "Power BI"
    ],
    "soft_skills": [
      "Leadership",
      "Autonomie",
      "Travail d’équipe",
      "Communication",
      "Organisation",
      "Résolution de problèmes",
      "Curiosité",
      "Esprit analytique"
    ]
  },

  "experience": [
    {
      "title": "Backend Software Engineer – Java / Python",
      "company": "Proxym Group",
      "period": "Octobre 2023 – Septembre 2025",
      "location": "Sousse, Tunisie",
      "tags": [
        "java",
        "spring",
        "banking",
        "microservices",
        "workflow-engine",
        "iso20022",
        "postgresql",
        "kubernetes",
        "state-machine"
      ],
      "bullets": [
        "Développement de modules bancaires critiques (gestion des cartes, paiements, virements) en respectant DDD et CQRS.",
        "Conception d'une machine à états interne pour gérer les workflows de validation et d’approbation Corporate (multi-niveaux, rôles, règles métiers dynamiques).",
        "Pilotage d’un projet réseau social interne avec déploiement complet sur Kubernetes (CI/CD, monitoring, microservices, stockage).",
        "Optimisation avancée de tests Spring, identification et correction d’un Hikari connection leak dans le pipeline GitLab.",
        "Collaboration avec équipes produit et architecture en environnement Agile Scrum.",
        "Rédaction de documentation technique et formation des nouveaux développeurs.",
        "Deploiment de la solution bancaire dans +200 banques et filiales en Europoe, Afrique et Moyen-Orient.",
        "Integration de messages ISO20022 pour les virements et transactions interbancaires."
      ]
    },
    {
      "title": "Stagiaire Machine Learning – Détection de Fraude Bancaire",
      "company": "Proxym Group",
      "period": "Juillet 2023 – Octobre 2023",
      "location": "Sousse, Tunisie",
      "tags": [
        "ml",
        "python",
        "scikit-learn",
        "tensorflow",
        "xgboost",
        "streaming",
        "kafka",
        "docker",
        "data-engineering"
      ],
      "bullets": [
        "Développé et déployé des modèles ML pour détecter les transactions frauduleuses en temps réel.",
        "Conçu un pipeline complet de données, de l’ingestion à la prédiction, incluant feature engineering et prétraitement.",
        "Implémenté des dashboards et alertes pour le suivi des performances et la détection des anomalies.",
        "Utilisé des outils d’Explainable AI (SHAP, LIME) pour expliquer les décisions des modèles aux équipes métier."
      ]
    },
    {
      "title": "Stagiaire Développeur Unity 3D (Jeux Vidéo)",
      "company": "CGI Studio",
      "period": "Jan 2023 – Mai 2023",
      "location": "Tunis, Tunisie",
      "tags": ["unity", "csharp", "3d", "game-dev"],
      "bullets": [
        "Implémentation de mécaniques de gameplay, intégration 3D et optimisation des performances visuelles.",
        "Implémentation de systèmes d’IA pour les NPC incluant pathfinding, machines à états et comportements adaptatifs.",
        "Participation à la production artistique et technique sous Unity."
      ]
    }
  ],

  "projects": [
    {
      "name": "Détection de Types d’Attaques en Cybersécurité",
      "year": "2026",
      "tags": [
        "machine-learning",
        "cybersecurity",
        "anomaly-detection",
        "classification",
        "data-science",
        "data-engineering",
        "ml-pipeline",
        "flask",
        "streamlit",
        "deployment"
      ],
      "bullets": [
        "Dirigé une équipe pluridisciplinaire (Data Analytics, Data Science, Data Engineering) pour concevoir un pipeline machine learning full-stack de classification d’attaques cyber, intégrant ingestion, prétraitement et scoring en temps réel.",
        "Réalisation d’une analyse exploratoire approfondie, nettoyage et ingénierie de 25 features issues de 40 000 logs réseau, incluant normalisation, encodage, extraction de patterns temporels et agrégation statistique avec pandas et NumPy.",
        "Entraînement, benchmark et optimisation de multiples modèles de classification multi-classes (Random Forest, XGBoost, LightGBM, SVM), avec évaluation fine via cross-validation, matrice de confusion et métriques F1/macro pour sélectionner la solution la plus performante.",
        "Conception et déploiement d’une interface web interactive (Flask + Streamlit) pour prédiction en temps réel à partir de fichiers CSV ou saisie manuelle, avec visualisation des résultats et dashboards analytiques dynamiques.",
        "Assurance de la reproductibilité et de la qualité via un dépôt GitHub structuré (README détaillé, requirements.txt, scripts de prétraitement et d’entraînement), accompagnée d’une documentation technique complète et d’une démonstration vidéo de l’application.",
        "Optimisation et automatisation du workflow ETL et ML avec gestion des dépendances Python, pipelines modulaires et bonnes pratiques Git, garantissant scalabilité, maintenance simplifiée et intégration continue."
      ]
    },
    {
      "name": "Career Intelligence Platform",
      "url": "https://github.com/xbdxllxhi2/career-intelligence",
      "year": "2025",
      "tags": [
        "airflow",
        "etl",
        "postgresql",
        "angular",
        "nlp",
        "llm",
        "dashboard",
        "matching",
        "scoring",
        "job-intelligence",
        "LangChain",
        "OpenAi"
      ],
      "bullets": [
        "Conception et création d’une plateforme d’intelligence du marché de l’emploi intégrant ingestion, analyse et valorisation de données multi-sources (logs, CVs, offres d’emploi) afin de mettre en valeur les compétences des utilisateurs et guider les recommandations personnalisées.",
        "Création d’un moteur avancé de matching profils–offres combinant scoring pondéré, distance géographique, similarité textuelle, NLP et machine learning (scikit-learn, XGBoost) pour optimiser la pertinence des correspondances entre profils et opportunités.",
        "Développement d’un pipeline data complet orchestré par Airflow, incluant ingestion, mapping vers schéma SQL, transformation et harmonisation des données à l’aide de pandas et NumPy, avec optimisation de la fiabilité, scalabilité et monitoring sur PostgreSQL.",
        "Développement d’une architecture full-stack avec FastAPI pour le backend et Angular pour le frontend, offrant visualisation des résultats, dashboards analytiques interactifs et suivi dynamique des KPIs.",
        "Exploitation de NLP et LLM (OpenAI API) pour l’extraction automatique de compétences, scoring sémantique, génération de rapports PDF automatisés et optimisation continue des prompts, tout en appliquant les meilleures pratiques OpenAI pour la sécurité, la performance et la réduction des coûts API.",
        "Benchmarking, analyse et optimisation continues du moteur de matching, des pipelines ETL et des modèles NLP, incluant l’évaluation des performances, ajustement des hyperparamètres et amélioration progressive de la précision des extractions et recommandations."
      ]
    },
    {
      "name": "Analyse de Sentiment et Recommandation de Produits",
      "year": "2026",
      "tags": [
        "ml",
        "nlp",
        "sentiment-analysis",
        "recommendation",
        "transformers",
        "pytorch",
        "fastapi",
        "docker"
      ],
      "bullets": [
        "Développé un modèle d’analyse de sentiment sur les avis clients pour améliorer les recommandations de produits.",
        "Implémenté un moteur de recommandation basé sur embeddings et similarité sémantique pour suggestions personnalisées.",
        "Construit un pipeline complet NLP incluant nettoyage des textes, tokenisation, vectorisation et API de déploiement avec FastAPI."
      ]
    },
    {
      "name": "Système de Pointage Biométrique IoT",
      "year": "2026",
      "tags": [
        "ml",
        "computer-vision",
        "biométrie",
        "face-recognition",
        "fingerprint",
        "opencv",
        "raspberry-pi",
        "iot",
        "docker"
      ],
      "bullets": [
        "Développé un système de pointage en temps réel utilisant reconnaissance faciale et empreintes digitales sur dispositifs IoT.",
        "Intégré la détection et la vérification biométrique avec OpenCV et algorithmes d’apprentissage supervisé pour précision optimale.",
        "Déployé le pipeline IoT complet avec Raspberry Pi, Docker et interface de suivi des présences en temps réel."
      ]
    },
    {
      "name": "TF-IDF Search Engine + Chatbot RAG",
      "year": "2025",
      "tags": [
        "rag",
        "nlp",
        "tf-idf",
        "semantic-search",
        "retrieval",
        "transformers",
        "embeddings"
      ],
      "bullets": [
        "Développement d’un moteur de recherche basé sur TF-IDF avec ranking dynamique et vectorisation optimisée.",
        "Conception d’un chatbot RAG combinant retrieval sémantique, embeddings et modèles LLM.",
        "Pipeline NLP complet : nettoyage, tokenisation, extraction de mots-clés, scoring et similarité vectorielle."
      ]
    },
    {
      "name": "Airflow Data Pipeline",
      "url": "https://github.com/xbdxllxhi2/career-intelligence/tree/main/data-aggregator",
      "year": "2025",
      "tags": ["airflow", "etl", "pipelines"],
      "bullets": [
        "Conception d’un pipeline ETL complet orchestré avec Airflow : ingestion, enrichissement, calculs, scoring et export.",
        "Utilisation avancée de PythonOperator, BashOperator et DAGs modulaires."
      ]
    },
    {
      "name": "Spring Keycloak OAuth2 SDK",
      "url": "https://github.com/xbdxllxhi2/clavis",
      "year": "2024",
      "tags": [
        "keycloak",
        "oauth2",
        "oidc",
        "jwt",
        "kafka",
        "sdk",
        "authentication"
      ],
      "bullets": [
        "Création d’un SDK Keycloak pour unifier l’authentification et l’autorisation dans un écosystème microservices Spring.",
        "Développement d’un Event Listener SPI Keycloak émettant des événements vers Kafka pour audit distribué.",
        "Gestion complète des rôles, permissions, tokens, refresh flows et user provisioning."
      ]
    },
    {
      "name": "Blockchain Settlement PoC",
      "year": "2024",
      "tags": [
        "blockchain",
        "ethereum",
        "smart-contracts",
        "cbs",
        "settlement"
      ],
      "bullets": [
        "Réalisation d’un PoC remplaçant un Core Banking System par un smart contract Ethereum pour le règlement interbancaire.",
        "Implémentation de primitives de paiement, journalisation on-chain et automatisation des validations."
      ]
    },
    {
      "name": "Hackathon IA – Visualisation socio-démographique",
      "url": "https://github.com/xbdxllxhi2/PACA-Demographical-Data-Chatbot",
      "year": "2025",
      "tags": ["ai", "visualisation", "leadership"],
      "bullets": [
        "Lead d’une équipe de 4 et développement d’une plateforme IA permettant d’interroger et visualiser des indicateurs socio-démographiques de la zone Provence-Alpes-Côte d'Azur.",
        "Mise en place d’un pipeline data complet avec automatisation et analyse avancée."
      ]
    }
  ],

  "languages": {
    "arabic": "natif",
    "french": "B2",
    "english": "B2"
  }
}
